Revit 2027 API
DWGImportOptions.GetLineWeights Method
 Gets array of line weights.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetLineWeights()
Public Function GetLineWeights As IList(Of Integer)
public:
IList<int>^ GetLineWeights()
member GetLineWeights : unit -> IList<int>
Return Value
IList<Int32>
See Also
Reference
DWGImportOptions Class
Autodesk.Revit.DB Namespace